#+title: Sccroll - A Units Tests library for C
#+author: Alexandre Martos

Sccroll is a library for units tests for softwares written in C.

#+begin_center
*This software is in alpha state, not yet releasable for
production. Use at your own risks.*
#+end_center

** Dependencies

The library design heavily depends on the *GNU C library* and
*GCC*. It was not tested on other libraries, so feel free to report any
issues if you test it. *This is planned to change before the first
official release*, in order to /not/ depend on any specific standard
library or compiler.

Note that the Makefile has additional dependencies on =rsync= and =gcovr=
(only if you try the library tests for the latter).

The dependencies versions the library was tested on:

#+begin_src bash :eval yes :exports results :results output replace
  ldd --version | head -n 1
  gcc --version | head -n 1
#+end_src

#+RESULTS:
: ldd (Debian GLIBC 2.37-7) 2.37
: gcc (Debian 13.2.0-2) 13.2.0

For a full list of headers the library depends on, see the [[file:MANUAL.org][manual]].

